// pages/health/conditioning.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    introduced: [
      {
        name: "饮食养生",
        introduction: "古人认为，合理饮食可以调养精气，纠正脏腑阴阳之偏，防治疾病，延年益寿。故饮食既要注意“博食”即以“五谷为养、五果为助、五畜为益、五菜为充”，又要重视五味调和，否则，会因营养失衡、体质偏颇、五脏六腑功能失调而致病。"
      },
      {
        name: "经络养生",
        introduction: "经络是遍布人体全身的“网络”系统，它控制着血和气的运行流动，以保证各组织系统的正常功能。《黄帝内经》说，经络具有决生死、处百病、调虚实之作用。古代养生学家认为，疏通经络可作为摄生的重要措施，而最简便的方法就是经常刺激、按摩、针灸三个重要穴位即合谷穴、内关穴和足三里穴。合谷穴可以防治颜面及五官方面的疾病，内关穴有助于防治心脏疾患，足三里穴则对预防五脏六腑特别是消化系统的疾病最有效。"
      },
      {
        name: "固精养生",
        introduction: "古人认为，精血是人体营养物质中的精华部分，是生命的物质基础，五脏六腑得精血的供养，才能保持其正常功能。如性欲无节，精血亏损过多，就会造成身体虚弱、病变百出、减损寿命。而保养阴精则可延缓衰老。"
      },
      {
        name: "顺时养生",
        introduction: "古人认为，天有四时气候的不同变化，地上万物有生、长、收、藏之规律，人体亦不例外。因此，古人从衣食住行等方面提出了顺时养生法。人的五脏六腑、阴阳气血的运行必须与四时相适应，不可反其道而行之。因时制宜地调节自己的生活行为，有助于健体防病，否则，逆春气易伤肝，逆夏气易伤心，逆秋气易伤肺，逆冬气易伤肾。"
      },
      {
        name: "减毒养生",
        introduction: "古人认为，人若喜怒无常则会导致体内阴阳、气血失调。劳累过度会损伤脾气，伤于饮食则生湿、热、痰浊。冒犯六淫，伤之外邪则百病丛生。这种致病因素被人体视为“毒”，因此提出以“减毒”来保全真气的养生之道。而通过饮食调理、服用药物及其它措施，减少体内积聚之毒，可免生疾患，防止早衰，进而延年益寿。"
      },
      {
        name: "静神养生",
        introduction: "静神在传统养生学中占有重要地位。古人认为，神是生命活动的主宰，保持神气清静，心理平稳，可保养元气，使五脏安和，并有助于预防疾病、增进健康和延年益寿。反之则怒伤肝、喜伤心、忧伤肺、恐伤肾，以至诱发种种身心疾患。"
      },
      {
        name: "修身养生",
        introduction: "古人认为，凡追求健康长寿者首先要从修身养性做起。平日应排除各种妄念，多说好话、多行善事。古医家孟说云：“若能保身养情者，常须善言莫离口”，“口有善言，又当身行善事”。孙思邈则说：“心诚意正思虑除，顺理修身去烦恼。”养成良好品行，常做有利于他人的事，可使自己心胸开阔、心情愉悦。"
      },
      {
        name: "调气养生",
        introduction: "古人认为，人体元气有化生、推动与固摄血液，温养全身组织，抵抗病邪，增强脏腑功能之作用。营养失衡、劳逸失当、情志失调、病邪夹击等诸多因素，可导致元气的虚、陷、滞、逆等症候，进而使机体发生病理性变化。调气养生法主张通过慎起居、顺四时、戒过劳、防过逸、调饮食、和五味、调七情、省言语、习吐纳、行导引等一系列措施来调养元气、祛病延年。"
      },
      {
        name: "进补养生",
        introduction: "传统医学十分推崇用滋补药物调理阴阳、补益脏腑、滋养精血。合理进补可以强身、防病、祛病。但进补既要辩证，又要适量，还应考虑顺应四时。服用补药时，如系入肺药，在秋季较合适;如系温补药，则在冬季比较适宜。"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})